{
  "korisnici": [
    {
      "id": 1,
      "username": "admin",
      "email": "admin@gmail.com",
      "password": "admin",
      "admin": true
    },
    {
      "id": 2,
      "username": "user",
      "email": "user@gmail.com",
      "password": "user",
      "admin": false
    },
    {
      "username": "pera",
      "email": "pera@gmail.com",
      "password": "pera",
      "admin": false,
      "id": 9
    },
    {
      "username": "filip1",
      "email": "filip@gmail.com",
      "password": "filip",
      "admin": false,
      "id": 10
    },
    {
      "username": "PetarP",
      "email": "petar@gmail.com",
      "password": "sifra",
      "admin": false,
      "id": 11
    }
  ],
  "kategorije": [
    {
      "id": 1,
      "kategorija": "Romani"
    },
    {
      "id": 2,
      "kategorija": "Pripovetke"
    },
    {
      "id": 3,
      "kategorija": "Ljubavni Romani"
    },
    {
      "id": 4,
      "kategorija": "Akcija/Avantura"
    },
    {
      "id": 5,
      "kategorija": "Trileri/Misterije"
    },
    {
      "id": 6,
      "kategorija": "Komedije"
    },
    {
      "id": 7,
      "kategorija": "Istorijski Romani"
    },
    {
      "id": 8,
      "kategorija": "Fantastika"
    },
    {
      "id": 9,
      "kategorija": "Horrori"
    }
  ],
  "knjige": [
    {
      "naziv": "PARAZIT",
      "autor": "Artur Konan Dojl",
      "opis": "Artur Konan Dojl je često koristio zastrašujuće elemente u svojim detektivskim pričama – npr. u Baskervilskom psu – ali, u racionalnom svetu u kojem se sve misterije mogu objasniti, ove elemente jasno ne treba shvatiti ozbiljno. Međutim, čitaoci horora setiće se da je Dojl napisao brojne priče strave u kojima svet nije racionalan, misterija se ne može objasniti, a ono što je zastrašujuće i natprirodno vlada trijumfalno.",
      "pismo": "latinica",
      "povez": "tvrd",
      "strana": 286,
      "stanje": 7,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/watermark/files/images/slike_proizvoda/thumbs_w/366891_w.jpg",
      "kategorijeId": "9",
      "cena": 1079,
      "id": 1
    },
    {
      "naziv": "POSLEDNJE PREŽIVELE",
      "autor": "Arejdi Hendriks",
      "opis": "Uzbudljiv roman strave i užasa koji prati grupu junakinja na ivici smrti, od sjajnog autora „Njujork tajmsovog” bestselera The Southern Book Club’s Guide to Slaying Vampires. U filmovima strave i užasa, finalna devojka je ona koja živa dočeka odjavnu špicu. Ona koja je uzvratila, pobedila ubicu i osvetila svoje prijatelje. Ona koja, iako ranjena, izlazi kao pobednica. Ali šta se dešava s njom kad se zvuk sirena izgubi u daljini i publika nastavi sa svojim životom? ",
      "pismo": "latinica",
      "povez": "broš",
      "strana": 312,
      "stanje": 2,
      "slikaUrl": "https://dereta.rs/cached/dereta.rs/Images/Poslednje-prezivele0-1000x0-0000129208251157.jpg",
      "kategorijeId": "5",
      "cena": 1149,
      "id": 2
    },
    {
      "naziv": "ODLETI",
      "autor": "Kristin Hana",
      "opis": "Nekada davno išla sam noću potpuno sama niz mračni put po imenu Ulica svitaca u najgoroj noći u mom životu, i pronašla srodnu dušu. To je bio naš početak. Pre više od trideset godina. Tali-i-Kejt. Ti i ja protiv sveta. Najbolje prijateljice zauvek. Ali priče imaju kraj, zar ne? Izgubiš ljude koje voliš i moraš da pronađeš način da nastaviš dalje...",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 392,
      "stanje": 5,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/images/slike_proizvoda/372683.jpg",
      "kategorijeId": "3",
      "cena": 699,
      "id": 3
    },
    {
      "naziv": "ĐAVO UVEK NOSI CRNO",
      "autor": " L. Dž. Šen",
      "opis": "Medi Goldblum voli život u Njujorku i skrojila je plan kako da sve u njenom životu bude savršeno. Ima posao u modnom studiju za venčanice, kuče na koje je uglavnom alergična i obećavajuću novu romantičnu vezu sa jednim divnim čovekom, pedijatrom.\n\nOčigledno je prebolela Čejsa Bleka, bivšeg momka milijardera, koji ju je bacio u vrtlog patnje nakon prevare šest meseci ranije. Ali kad se Čejs pojavi na njenom pragu i saopšti joj da mu otac umire a da mu je on rekao da se verio, Medi iz saosećanja prema starcu nevoljno pristaje da glumi Čejsovu verenicu na porodičnom okupljanju. Ako ništa drugo, makar da vidi kako se Čejs koprca. Naravno, uslediće niz nepredviđenih događaja koji će razbiti u paramparčad plan o savršenom životu s pedijatrom u Njujorku.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 360,
      "stanje": 4,
      "slikaUrl": "https://www.laguna.rs/_img/korice/5706/djavo_uvek_nosi_crno-l_dz_sen_v.jpg",
      "kategorijeId": "3",
      "cena": 739,
      "id": 4
    },
    {
      "naziv": "RALFOVA OSVETA",
      "autor": "Deli",
      "opis": "Ralf Hoton je poticao iz odlične porodice. Njegova majka bila je poslednji potomak stare otmene porodice iz Overnje. Ali osim svoje inženjerske plate, on nije imao nikakvu imovinu. Bio je siroče, bez ikakvih bliskih rođaka, pa je živeo sam sa slugom u malom paviljonu određenom za stanovanje inženjera. Gospođa Sorben je hvalila njegovu ozbiljnost, priznajući pritom da kod njega postoji neka suzdržanost koja nije dopuštala da mu se iko približi. Činilo se da ne želi da mu se neko meša u privatni život.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 200,
      "stanje": 11,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/images/slike_proizvoda/368269.jpg",
      "kategorijeId": "3",
      "cena": 809,
      "id": 5
    },
    {
      "naziv": "PUNK 57",
      "autor": "Penelopi Daglas",
      "opis": "Ne mogu da se ne nasmešim na ono što je napisala u pismu. Nedostajem joj. Nastavnica u petom razredu povezala nas je sa decom iz druge škole s kojom ćemo se dopisivati. Misleći da sam devojčica, pošto se zovem Miša, druga nastavnica me je spojila sa svojom učenicom Rajen. Misleći da je Rajen dečak, kao i ja, moja nastavnica se složila. Nije nam trebalo mnogo vremena da otkrijemo grešku. A za tili čas raspravljali smo o svemu: gde se naručuju najbolje pice, da li je bolji android ili ajfon, da li je Eminem najbolji reper na svetu… To je bio samo početak. Narednih sedam godina to smo bili mi.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 282,
      "stanje": 2,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/watermark/files/images/slike_proizvoda/thumbs_w/372351_w.jpg",
      "kategorijeId": "3",
      "cena": 749,
      "id": 6
    },
    {
      "naziv": "POTAMAN",
      "autor": "Eni Pru",
      "opis": "Priče Eni Pru o pokolenjima Amerikanaca koji se bore da opstanu na Zapadu predstavljaju jednu surovu, zaslepljujuću panoramu američke ludosti i usuda. To su priče o modernim kaubojima iz ruralnog dela Vajominga, ali ni u kom slučaju nisu tipične kaubojske priče, budući da u njima nema sukoba na liniji dobro – zlo, a junaci nipošto nisu heroji, nego mali ljudi sputani svojim svakodnevnim nevoljama, počesto začudnim i bizarnim, što pričama daje dodatnu privlačnost i upečatljivost. Oni pokušavaju da se otrgnu od bede i očaja, ali nešto ih uvek sputava i osujećuje, kao da sama zemlja traži njihovu krv.",
      "pismo": "Latinica",
      "povez": "Tvrd",
      "strana": 230,
      "stanje": 2,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/watermark/files/images/slike_proizvoda/thumbs_w/224228_w.jpg",
      "kategorijeId": "2",
      "cena": 699,
      "id": 7
    },
    {
      "naziv": "SLOBODA",
      "autor": "Grupa autora",
      "opis": "Ova izuzetna knjiga je antologija kratkih priča koju su napisali neki od najistaknutijih savremenih pisaca inspirisani Opštom deklaracijom o ljudskim pravima koja znamenito počinje sa: „Sva ljudska bića rađaju se slobodna i jednaka.“ Većina priča napisana je posebno za ovu priliku. Svaki pisac je odabrao po jedan član Deklaracije koji mu je poslužio kao moto i nadahnuće za priču. Rezultat je ova izvanredna i očaravajuća zbirka misaonih, ozbiljnih, duhovitih i zabavnih kratkih proznih bravura koje nam ponekad otvaraju sasvim nove poglede na temu o ljudskim pravima. Urađena u saradnji sa organizacijom Amnesty International, Sloboda je delo koje će pobuditi maštu čitalaca i ukazati nam na to koliko nam svima ova prava znače.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 463,
      "stanje": 6,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/images/slike_proizvoda/221611.jpg",
      "kategorijeId": "2",
      "cena": 814,
      "id": 8
    },
    {
      "naziv": "UGRIZI",
      "autor": "Andrej Blatnik",
      "opis": "Kratke priče Andreja Blatnika - vrsnog majstora ovog žanra - pod mikroskop stavljaju sudbinske trenutke koji raznolike protagoniste drže u procepu. Hoće li hirurzi spasiti mogućeg ubicu svog kolege, koji snajperista će pogoditi metu prvi, dokle seže dodir ispod stola? Učiniti nešto ili ništa, i jedno i drugo podjednako je nemoguće. Odgovornost je utoliko veća što jedna jedina odluka može imati neočekivane posledice ne samo za pojedinca nego i za ceo svet i istoriju, sve do poslednjeg preživelog čoveka, koji se, možda, još zaslepljuje verom da je sve bilo plod puke slučajnosti.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 106,
      "stanje": 2,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/images/slike_proizvoda/360105.jpg",
      "kategorijeId": "2",
      "cena": 660,
      "id": 9
    },
    {
      "naziv": "IZGUBLJENA DUŠA",
      "autor": "Olga Tokarčuk",
      "opis": "Izgubljena duša je parabola o ubrzanom vremenu, ritmu s kojim ne umemo više da izađemo na kraj, nostalgija za univerzalnim vremenom u kom bismo svi uspeli da se pronađemo. Prikazuje savremenog čoveka koji je izgubio osećaj smisla života, kojem u trku svakodnevice preostaje malo vremena za refleksiju, za postavljanje sebi fundamentalnih pitanja o ispunjenosti u životu.\nMetafora izgubljene duše je odavno prisutna u kulturi. Olga Tokarčuk, Jungova sledbenica, nadovezuje se na opis sindroma gubitka duše kod njegovih pacijenata, i na svoj način priču poetizuje. Ilustrovana",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 48,
      "stanje": 5,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/watermark/files/images/slike_proizvoda/thumbs_w/350859_w.jpg",
      "kategorijeId": "2",
      "cena": 1187,
      "id": 10
    },
    {
      "naziv": "ŠPIJUN",
      "autor": "Danijela Stil",
      "opis": "U osamnaestoj godini, Aleksandru Vikam su u raskošnoj beloj čipki i satenskoj haljini predstavili kralju Džordžu V i kraljici Meri. Ona je nežna i plavokosa, zapanjujuće lepa, i naizgled je predodređena za privilegovan život. Ali sudbina, svetski rat, i njen tih ali buntovan karakter odvode je drugim putem. Godine 1939. Evropa je u plamenu, a Engleska u ratu. Iz svog doma u idiličnom Hempširu, Aleks odlazi u London kao volonterka u jedinicama Prve pomoći.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 250,
      "stanje": 13,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/images/slike_proizvoda/373623.jpg",
      "kategorijeId": "1",
      "cena": 579,
      "id": 11
    },
    {
      "naziv": "LAVOVI SA PETE AVENIJE",
      "autor": "Fiona Dejvis",
      "opis": "Godina je 1913. i reklo bi se da Lora Lajons ima sve: njen suprug je nadzornik u Njujorškoj gradskoj biblioteci, žive u najlepšoj zgradi na Menhetnu, blagosloveni sa dvoje dece. Ali uporna i strastvena Lora želi da radi i bude nezavisna. Počinje da piše i objavljuje novinske članke, upoznaje članice kluba Heterodoksi koje se zalažu za pravo žena da glasaju i budu samostalne. A kada vredne knjige nestanu iz biblioteke, preteći da sruše sva njena uverenja, moraće da promeni svoje stavove, rizikujući da izgubi sve.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 320,
      "stanje": 11,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/watermark/files/images/slike_proizvoda/thumbs_w/373592_w.jpg",
      "kategorijeId": "1",
      "cena": 989,
      "id": 12
    },
    {
      "naziv": "STRELAC",
      "autor": "Paulo Koeljo",
      "opis": "Nekada slavan zbog svoje izuzetne streličarske veštine, Tecuja je izabrao da živi povučeno kao drvodelja u zabačenom selu. ",
      "pismo": "Latinica",
      "povez": "Tvrd",
      "strana": 152,
      "stanje": 2,
      "slikaUrl": "https://www.laguna.rs/_img/korice/5711/strelac-paulo_koeljo_v.jpg",
      "kategorijeId": "1",
      "cena": 809,
      "id": 13
    },
    {
      "naziv": "TIRANIN BANDERAS",
      "autor": "Ramon Del Valje Inklan",
      "opis": "Kultno delo jednog od najznačajnijih španskih pisaca XX veka, koje predstavlja klicu iz koje je kasnije nikao najznačajniji pravac razvoja latinoameričke književnosti uopšte. Ovo je prvi roman o diktaturi, kasnije toliko prisutnoj u Latinskoj Americi, roman koji je postao direktna inspiracija i Markesu za njegovu „Jesen patrijarha“ i Bastosu za „Ja, vrhovni“. Valje-Inklan nam na njemu svojstven način, uz obilje lokalizama i uz pomoć specifičnog narativa, dočarava svu bahatost, drskost, glupost i surovost diktatora koji je prigrabio ne samo civilnu već i svešteničku, vojnu i sudsku vlast. Nešto što nam možda zvuči poznato.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 242,
      "stanje": 2,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/watermark/files/images/slike_proizvoda/thumbs_w/373275_w.jpg",
      "kategorijeId": "1",
      "cena": 1320,
      "id": 14
    },
    {
      "naziv": "POGREŠNA PORODICA",
      "autor": "Tarin Fišer",
      "opis": "Kad si odrasla osoba, možeš da kontolišeš koga puštašu svoj život, ali ne možeš da kontrolišeš kako će se ponašati kada ih pustiš.\n\n\nDžuno je pogrešila u vezi s Vini Krauč. Pre nego što se uselila kod porodice Krauč, Džuno je mislila da Vini i njen muž Najdžel imaju savršen brak, savršenog sina, savršen život. Tek sad, kad živi u njihovoj predivnoj kući, vidi da je nemoguće zanemariti pukotine na trošnoj fasadi.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 267,
      "stanje": 4,
      "slikaUrl": "https://www.delfi.rs/_img/artikli/2021/09/pogresna_porodica_vv.jpg",
      "kategorijeId": "4",
      "cena": 809,
      "id": 15
    },
    {
      "naziv": "NESAVRŠENE ŽENE",
      "autor": "Araminta Hol",
      "opis": "Kada je Nensi Henesi ubijena, za sobom je ostavila dve najbolje prijateljice, divnog muža, ćerku i ljubavnika, čiji je identitet odnela u grob. Nensi je bila neverovatno lepa, bogata, omiljena u svakom društvu. Njen život je naizgled delovao savršeno. Ali dok istraga o njenoj smrti tapka u mestu, a najbolje prijateljice, Elenor i Meri, hrabro podnose nepremostivi gubitak, na površinu izbijaju mračni detalji koji otkrivaju koliko su malo znale o svojoj prijateljici, jedna o drugoj, a možda i o sebi samima.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 326,
      "stanje": 11,
      "slikaUrl": "https://dereta.rs/cached/dereta.rs/Images/Nesavrsene-zene0-1000x0-0000129206124232.jpg",
      "kategorijeId": "4",
      "cena": 899,
      "id": 16
    },
    {
      "naziv": "NJENA AFRIČKA AVANTURA",
      "autor": "Tejlor Stivens",
      "opis": "Mogu da osetim tvoj strah i čujem laž u tvom glasu. Znam tvoje slabosti i neću se ustručavati da ih iskoristim. Ja sam kameleon i lovac. Živela sam u osamnaest država, imam tri pasoša i govorim dvadeset dva jezika. Ubijala sam mnogo. To se ne očekuje od deteta rođenog u misionarskoj porodici u Africi, ali radila sam sve što je bilo potrebno da bih preživela.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 202,
      "stanje": 1,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/watermark/files/images/slike_proizvoda/thumbs_w/243759_w.jpg",
      "kategorijeId": "4",
      "cena": 594,
      "id": 17
    },
    {
      "naziv": "TRAGOM SVETOG GRALA",
      "autor": "Nelson de Mil",
      "opis": "Uzbudljiva avantura za sva čula vodi čitaoca od prekrasnih vrtova Vatikana i kapija velelepnog Rima sve do samog srca vrelih džungli Etiopije.\n\nDok građanski rat u Etiopiji ne jenjava, stari katolički sveštenik Đuzepe sedi u zatvorskoj ćeliji. Prošlo je dugih četrdeset godina od kada je poslednji put ugledao svetlost dana. A onda, nakon što je izgubio svaku nadu, bombaški napad Đuzepeu pruža priliku za beg.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 376,
      "stanje": 2,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/watermark/files/images/slike_proizvoda/thumbs_w/279935_w.jpg",
      "kategorijeId": "4",
      "cena": 849,
      "id": 18
    },
    {
      "naziv": "ŠAPTAČ",
      "autor": "Donato Karizi",
      "opis": "Ne pomaže ti da znaš kako. Ne vredi ti da shvatiš zašto. Nije ti dovoljno da otkriješ ko. On je već korak ispred.\n\nOtkiven je stravičan zločin: šest odsečenih ruku poređano je u misteriozan krug i zakopano na proplanku u šumi. Pet pripada devojkama koje se vode kao nestale. Šesta ruka tek treba da bude identifikovana. Najstrašnije od svega jeste to što tela devojaka, bilo da su žive ili mrtve, nigde nisu pronađena.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 360,
      "stanje": 13,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/watermark/files/images/slike_proizvoda/thumbs_w/248064_w.jpg",
      "kategorijeId": "5",
      "cena": 699,
      "id": 19
    },
    {
      "naziv": "GAJGER",
      "autor": "Gustaf Šerderman",
      "opis": "Otišla je do tajnog skrovišta i izvukla veliki crni pištolj\nsa prigušivačem. Približila se svom mužu otpozadi i\nprislonila mu cev na glavu. Onda je povukla obarač.\nMlaz krvi poteče na knjigu, koja odmah ispade iz\nStelanovih ruku. Geteov Faust na originalnom\nnemačkom.\nNeobično ubistvo nije slučaj Sare Novak. Ali njene\nkolege znaju da je ona odrasla sa Bromanovima i da\nih poznaje bolje od bilo koga. Pridružuje se istrazi\nkoja će je dovesti do zapanjujućih otkrića o pravom\nidentitetu i mračnoj prošlosti ljudi koje smatrala\nsvojom porodicom. A tajanstvena reč samo je prvi\ndelić slagalice zamršene zavere stvorene pola veka\nranije.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 352,
      "stanje": 4,
      "slikaUrl": "https://www.vulkani.rs/files/images/slike_proizvoda/25717.jpg",
      "kategorijeId": "5",
      "cena": 499,
      "id": 20
    },
    {
      "naziv": "TIHI PACIJENT",
      "autor": "Aleks Mihaelides",
      "opis": "Te kobne noći, stajala je u beloj haljini, nakon što je ispalila pet hitaca. Nije rekla ni reč. Nije odgovarala na pitanja. Nije mogla, a nije ni htela da govori. Čak i kad je optužena za ubistvo supruga. Ćutala je i kad je uhapšena. Odbijala je da prizna ili porekne krivicu. Nikad nije progovorila.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 272,
      "stanje": 6,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/watermark/files/images/slike_proizvoda/thumbs_w/338346_w.jpg",
      "kategorijeId": "5",
      "cena": 699,
      "id": 21
    },
    {
      "naziv": "PISMO GLAVA",
      "autor": "Džefri Arčer",
      "opis": "Od ranog detinjstva je bilo jasno da je Aleksandar Karpenko predodređen za velike stvari. Ali kad njegovog oca ubije KGB zbog pokušaja sindikalnog organizovanja, Aleksandar i njegova majka moraju da pobegnu iz Rusije ako žele da prežive. Kad stignu u luku u dogovoreni čas, nađu se pred nepovratnim izborom: ukrcati se ili na teretni brod za Ameriku, ili na teretni brod za Veliku Britaniju. Aleksandar taj izbor prepušta bacanju novčića. Pismo ili glav",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 544,
      "stanje": 2,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/images/slike_proizvoda/368272.jpg",
      "kategorijeId": "7",
      "cena": 1709,
      "id": 22
    },
    {
      "naziv": "PRIČA O ZEMLJI I MORU",
      "autor": "Kejti Simpsons Smit",
      "opis": "Pričom koja se odigrava u malom primorskom mestu u Severnoj Karolini, u godinama kada se Američka revolucija već bliži kraju, ovaj briljantni roman prati tri generacije jedne porodice, junake koji žude za iskupljenjem usred omamljujućeg vrtloga rata, otmica, ropstva i ljubavi.\n\nDžon, gusar koji se zbog ljubavi vezao za kopno vraća se na more u nadi da će morska so izlečiti njegovu kćer Tabitu od smrtonosne žute groznice.\n\nGodinama ranije, njegova žena Helen gazi sve konvencije i želje pobožnog oca Ejse, kako bi se udala za ozloglašenog gusara Džona načinivši time odluku koja će im svima promeniti živote.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 264,
      "stanje": 3,
      "slikaUrl": "https://www.laguna.rs/_img/korice/2527/prica_o_zemlji_i_moru-kejti_simpson_smit_v.jpg",
      "kategorijeId": "7",
      "cena": 674,
      "id": 23
    },
    {
      "naziv": "LUČONOŠE",
      "autor": "Rouzmari Satklif",
      "opis": "Poslednji deo najprodavanije trilogije o rimskoj Britaniji započete romanom Orao devete legije, a nastavljene romanom Srebrna grana.\n\nIz Britanije su zauvek otplovili poslednji rimski vojnici i prepustili je građanskom ratu i opasnosti od saksonske najezde.\nAkvila napušta svoj puk i vraća se porodici, ali u ruševinama zatiče i svoj dom i sve što je voleo. Posle mnogo godina teškog rada i odricanja, Akvilu na kraju samo jedno održava u životu – želja za osvetom...",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 368,
      "stanje": 7,
      "slikaUrl": "https://www.laguna.rs/_img/korice/1912/luconose-rouzmari_satklif_v.jpg",
      "kategorijeId": "7",
      "cena": 788,
      "id": 24
    },
    {
      "naziv": "M SIN VEKA",
      "autor": "Antonio Skurati",
      "opis": "On je poput zveri: oseća vreme koje dolazi. Nanjušio ga je. Nanjušio je iscrpljenu Italiju, umornu od demokratije u agoniji i nesposobnih političara koji učestvuju u njenoj propasti. Zato se stavlja na čelo paravojnih milicija, prestupnika, palikuća i „čistokrvnih fašista“, koji su najopasniji i najsuroviji. U izveštaju Službe državne bezbednosti iz 1919. opisan je kao „inteligentan, snažne građe, iako boluje od sifilisa, sladostrastan, emotivan, smeo, neko kome se ljudi na prvi pogled dopadnu ili ne dopadnu“. On je Benito Musolini, bivši socijalistički vođa izbačen iz partije, neumorni politički agitator, direktor malog opozicionog lista.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 744,
      "stanje": 3,
      "slikaUrl": "https://www.laguna.rs/_img/korice/4981/m_sin_veka-antonio_skurati_v.jpg",
      "kategorijeId": "7",
      "cena": 1259,
      "id": 25
    },
    {
      "naziv": "USPON MRAKA",
      "autor": "K. S. Pakat",
      "opis": "Bežeći od ljudi koji su mu ubili majku, Vil postaje deo sasvim drugačijeg sveta. Sveta u kojem postoji magija. Sveta u kojem mora da vežba do iznemoglosti da bi odigrao ključnu ulogu u predstojećoj borbi protiv Mraka. Dok London iščekuje povratak Mračnog kralja, a mladi ratnici Svetla i Mraka traže svoje mesto u ratu koji se bliži, heroji i zlikovci iz starih legendi vraćaju se da se ponovo sretnu na bojnom polju. U njihovim se dušama bude davnašnje strasti, davnašnja neprijateljstva… i plamen ljubavi, jači i od večnosti.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 352,
      "stanje": 3,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/watermark/files/images/slike_proizvoda/thumbs_w/366052_w.jpg",
      "kategorijeId": "8",
      "cena": 1019,
      "id": 26
    },
    {
      "naziv": "IZ ČISTA MIRA",
      "autor": "Džo Aberkrombi",
      "opis": "Mir je samo drugačija vrsta bojišta... Savina dan Glokta, nekada najmoćnija poslovna žena Adove, shvata da su njena sposobnost procene, ugled i bogatstvo ozbiljno načeti. Svejedno, neće odustati od svojih ogromnih ambicija, i nikakvi obziri je neće sprečiti da ih ostvari.\n\nZa junake poput Lea dan Broka i Staura Mračnog, ljude srećne jedino kad u ruci drže mač, mir predstavlja mučenje koje treba okončati što je pre moguće. Zato stare mržnje treba razbuditi, nove saveznike pronaći, dok nova vladarka Afrita mora da ovlada dugim okom… pre nego što je ono ubije",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 559,
      "stanje": 5,
      "slikaUrl": "https://www.laguna.rs/_img/korice/5483/iz_cista_mira-dzo_aberkrombi_v.jpg",
      "kategorijeId": "8",
      "cena": 1709,
      "id": 27
    },
    {
      "naziv": "CAREVA DUŠA",
      "autor": "Brendon Sanderson",
      "opis": "Kada Šai uhvate na delu dok mesečevo žezlo zamenjuje svojom besprekornom krivotvorinom, ona mora da se pogađa i pregovara kako bi sačuvala živu glavu.\n\nNakon napada plaćenog ubice, car Ašravan osta je bez svesti, što su okolnosti koje je prikrila samo pogibija njegove supruge. Ako se car ne pojavi u javnosti po isteku stodnevne žalosti, Tekovinska frakcija će ostati bez vlasti, a carstvom će zavladati haos.",
      "pismo": "Latinica",
      "povez": "Tvrd",
      "strana": 157,
      "stanje": 8,
      "slikaUrl": "https://www.delfi.rs/_img/artikli/2022/11/careva_dusa_vv.jpg",
      "kategorijeId": "8",
      "cena": 1350,
      "id": 28
    },
    {
      "naziv": "BORN",
      "autor": "Džef Vandermer",
      "opis": "U razrušenom, bezimenom gradu budućnosti, jedna mlada žena po imenu Rejčel, koja živi od sakupljanja bilo čega što bi moglo biti korisno, u krznu Morda, džinovskog letećeg medveda, despota njihovog sveta, pronalazi upetljano stvorenje i daje mu ime Born. Isprva Born ne liči ni na šta – tek zelenkasta grudva nečega što bi prosto moglo biti samo Kompanijin biotehnološki otpad, ali on Rejčel podseća na ostrvo na kom je rođena, sada davno nestalo pod morem. Oseća neku vezu s njim koju poriče, jer veze su zamke, a u njenom svetu svaka slabost može značiti smrt. Ipak donosi Borna u Balkonski greben, podzemno sklonište gde živi sa Vikom, dilerom koji prodaje sećanja, jedini beg iz jalovog, pobeđenog i slomljenog grada. Rejčel uspeva ubediti Vika da ne iskoristi Borna kao sirovi genetski materijal u svojoj laboratoriji. Šta je Born?",
      "pismo": "Latinica",
      "povez": "Tvrd",
      "strana": 330,
      "stanje": 3,
      "slikaUrl": "https://www.knjizararoman.rs/__public/upload/2021/05/25/knjiga-born-dzef-vandermer-orfelin-knjizara-roman-foto2-77901.jpg",
      "kategorijeId": "8",
      "cena": 1584,
      "id": 29
    },
    {
      "naziv": "KNJIGA EJBONOVA",
      "autor": "Klark Ešton Smit",
      "opis": "Knjiga Ejbonova Klarka Eštona Smita manje je poznata sestra bliznakinja Nekronomikona H. F. Lavkrafta.",
      "pismo": "Latinica",
      "povez": "Tvrd",
      "strana": 460,
      "stanje": 7,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/watermark/files/images/slike_proizvoda/thumbs_w/359560_w.jpg",
      "kategorijeId": "9",
      "cena": 2475,
      "id": 30
    },
    {
      "naziv": "PREDSKAZANJE",
      "autor": "Dejvid Selcer",
      "opis": "Džeremi Torn i njegova supruga Ketrin upravo su poželeli dobrodošlicu na ovaj svet najnovijem članu porodice, predivnom sinu Dejmijenu. Ali užas oko dečaka raste naporedo s njim. Izgleda da nesreće s kobnim ishodom, samoubistva i neobjašnjivo nasilje prate Tornove na svakom koraku – ali zašto? I kako Dejmijen može da ima bilo kakve veze s takvim krvoprolićem i stradanjima? On je samo dete…",
      "pismo": "Latinica",
      "povez": "Tvrd",
      "strana": 240,
      "stanje": 3,
      "slikaUrl": "https://www.vulkani.rs/files/images/slike_proizvoda/24051.jpg",
      "kategorijeId": "9",
      "cena": 1019,
      "id": 31
    },
    {
      "naziv": "FANTOMSKI LJUBAVNIK",
      "autor": "Vernon Li",
      "opis": "Vernon Li je pseudonim Vajolet Pedžet (1856 – 1935), koju su savremenici nazivali “najumnijom Evropljkankom”. Tek mali deo njenog opusa – bavila se prvenstveno istorijom evropske umetnosti od renesanse pa naovamo – posvećen je književnosti strave, zapravo veoma neobičnim pričama o duhovima, ali su te priče prava remek-dela žanra. „Niko od nas ne veruje u duhove kao u logičke mogućnosti, nego ih većina među nama zamišlja kao imaginativne mogućnosti; i dalje možemo da osetimo ono sablasno, pa je prema tome sablast jedina stvar koja u bilo kom smislu može za nas da zameni drevna božanstva i omogući nam da razumemo, makar i samo na minut, imaginativnu moć koju su ona posedovala, a koju su im preoteli ne samo logika nego i umetnost.",
      "pismo": "Latinica",
      "povez": "Tvrd",
      "strana": 356,
      "stanje": 4,
      "slikaUrl": "https://www.knjizare-vulkan.rs/files/watermark/files/images/slike_proizvoda/thumbs_w/363461_w.jpg",
      "kategorijeId": "9",
      "cena": 1485,
      "id": 32
    },
    {
      "naziv": "KAKO NOVČIĆ KAŽE",
      "autor": "Džejms Bejli",
      "opis": "Ko kaže da se ne može sve prepustiti slučaju?\n\nOn je voli! Šta može krenuti po zlu?\nNovogodišnje je veče. Oni su u kabini Londonskog oka. On je prosi. Sve je savršeno.\n\nAli ona kaže NE.\nI vožnja traje još jezivih dvadeset devet minuta u potpunoj tišini.\n\nA onda je sve pošlo od lošeg na gore pošto je Džoš izgubio posao i vratio se u Bristol da živi kod svojih roditelja. Ubeđen da ne ume samostalno da donosi ispravne odluke, rešava da sledećih godinu dana, svaki put kad se nađe u nedoumici ili mora o nečemu važnom da se izjasni, baci novčić.",
      "pismo": "Latinica",
      "povez": "Broš",
      "strana": 308,
      "stanje": 4,
      "slikaUrl": "https://www.delfi.rs/_img/artikli/2021/04/kako_novcic_kaze_vv.jpg",
      "kategorijeId": "6",
      "cena": 809,
      "id": 33
    }
  ],
  "porudzbine": [
    {
      "korisniciId": 1,
      "datumKreiranja": "2023/01/30",
      "ime": "Pera",
      "prezime": "Peric",
      "grad": "Beograd",
      "adresa": "Adresa1",
      "zip": 10000,
      "brTelefona": 123456789,
      "status": "Isporuka",
      "id": 1
    },
    {
      "korisniciId": "3",
      "datumKreiranja": "2023/01/29",
      "ime": "Mare",
      "prezime": "Maric",
      "grad": "Beograd",
      "adresa": "Adresa1",
      "zip": 10000,
      "brTelefona": 123456789,
      "status": "Otkazana",
      "id": 2
    },
    {
      "korisniciId": "2",
      "datumKreiranja": "2023/01/31",
      "ime": "Filip",
      "prezime": "Filipovic",
      "grad": "Beograd",
      "adresa": "Adresa1",
      "zip": 3123,
      "brTelefona": 42342324,
      "status": "Kreirana",
      "id": 3
    },
    {
      "korisniciId": "11",
      "datumKreiranja": "2023/01/20",
      "ime": "Petar",
      "prezime": "Petrovic",
      "grad": "Čačak",
      "adresa": "Prva Adresa",
      "zip": 32000,
      "brTelefona": 666423442,
      "status": "Završena",
      "id": 4
    },
    {
      "korisniciId": "11",
      "datumKreiranja": "2023/01/25",
      "ime": "Petar",
      "prezime": "Petrovic",
      "grad": "Čačak",
      "adresa": "Prva Adresa",
      "zip": 32000,
      "brTelefona": 6424322,
      "status": "Otkazana",
      "id": 5
    },
    {
      "korisniciId": "11",
      "datumKreiranja": "2023/01/31",
      "ime": "Petar",
      "prezime": "Petrović",
      "grad": "Čačak",
      "adresa": "Prva Adresa",
      "zip": 32000,
      "brTelefona": 643234234,
      "status": "Kreirana",
      "id": 6
    },
    {
      "korisniciId": "11",
      "datumKreiranja": "2023/01/31",
      "ime": "Petar",
      "prezime": "Petrović",
      "grad": "Čačak",
      "adresa": "Prva Adresa",
      "zip": 32000,
      "brTelefona": 65234234,
      "status": "Kreirana",
      "id": 7
    }
  ],
  "stavke": [
    {
      "id": 1,
      "porudzbineId": 1,
      "knjigeId": 2,
      "brPrimeraka": 1
    },
    {
      "id": 2,
      "porudzbineId": 1,
      "knjigeId": 1,
      "brPrimeraka": 1
    },
    {
      "knjigeId": 1,
      "brPrimeraka": 2,
      "porudzbineId": 3,
      "id": 3
    },
    {
      "knjigeId": 32,
      "brPrimeraka": 2,
      "porudzbineId": 4,
      "id": 4
    },
    {
      "knjigeId": 4,
      "brPrimeraka": 1,
      "porudzbineId": 4,
      "id": 5
    },
    {
      "knjigeId": 3,
      "brPrimeraka": 2,
      "porudzbineId": 5,
      "id": 6
    },
    {
      "knjigeId": 8,
      "brPrimeraka": 1,
      "porudzbineId": 5,
      "id": 7
    },
    {
      "knjigeId": 9,
      "brPrimeraka": 1,
      "porudzbineId": 5,
      "id": 8
    },
    {
      "knjigeId": 14,
      "brPrimeraka": 1,
      "porudzbineId": 6,
      "id": 9
    },
    {
      "knjigeId": 2,
      "brPrimeraka": 1,
      "porudzbineId": 6,
      "id": 10
    },
    {
      "knjigeId": 15,
      "brPrimeraka": 1,
      "porudzbineId": 7,
      "id": 11
    },
    {
      "knjigeId": 17,
      "brPrimeraka": 1,
      "porudzbineId": 7,
      "id": 12
    },
    {
      "knjigeId": 24,
      "brPrimeraka": 2,
      "porudzbineId": 7,
      "id": 13
    },
    {
      "knjigeId": 6,
      "brPrimeraka": 1,
      "porudzbineId": 7,
      "id": 14
    },
    {
      "knjigeId": 7,
      "brPrimeraka": 1,
      "porudzbineId": 7,
      "id": 15
    }
  ]
}